HloModule jit__threefry_fold_in, entry_computation_layout={(u32[2]{0}, u32[])->u32[2]{0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

FileNames
1 "/Users/chaitanya/Downloads/MLIR/end2end/ml-compiler/JAX/model.py"
2 "/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/pytreelib.py"
3 "/Users/chaitanya/Downloads/MLIR/end2end/ml-compiler/JAX/src/MyNeuralNet.py"
4 "/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/nn/linear.py"
5 "/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/rnglib.py"

FunctionNames
1 "<module>"
2 "main"
3 "PytreeMeta.__call__"
4 "_graph_node_meta_call"
5 "PytreeMeta._pytree_meta_construct"
6 "MyNeuralNet.__init__"
7 "Linear.__init__"
8 "RngStream.__call__"

FileLocations
1 {file_name_id=1 function_name_id=1 line=70 end_line=70 column=4 end_column=10}
2 {file_name_id=1 function_name_id=2 line=20 end_line=20 column=12 end_column=114}
3 {file_name_id=2 function_name_id=3 line=420 end_line=420 column=13 end_column=56}
4 {file_name_id=2 function_name_id=4 line=431 end_line=431 column=2 end_column=51}
5 {file_name_id=2 function_name_id=5 line=423 end_line=423 column=4 end_column=34}
6 {file_name_id=3 function_name_id=6 line=9 end_line=9 column=22 end_column=68}
7 {file_name_id=4 function_name_id=7 line=375 end_line=375 column=17 end_column=30}
8 {file_name_id=5 function_name_id=8 line=122 end_line=122 column=10 end_column=56}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=6}
7 {file_location_id=3 parent_frame_id=7}
8 {file_location_id=4 parent_frame_id=8}
9 {file_location_id=5 parent_frame_id=9}
10 {file_location_id=7 parent_frame_id=10}
11 {file_location_id=8 parent_frame_id=11}


%closed_call.1 (Arg_0.1: s32[], Arg_1.1: u32[1], Arg_2.1: u32[1], Arg_3.1: u32[], Arg_4.1: u32[], Arg_5.1: u32[], Arg_6.1: u32[4], Arg_7.1: u32[4]) -> (s32[], u32[1], u32[1], u32[], u32[], /*index=5*/u32[], u32[4], u32[4]) {
  %Arg_0.1 = s32[] parameter(0)
  %constant.9 = s32[] constant(1)
  %add.16 = s32[] add(%Arg_0.1, %constant.9), metadata={op_name="add"}
  %Arg_1.1 = u32[1]{0} parameter(1)
  %Arg_2.1 = u32[1]{0} parameter(2)
  %add.17 = u32[1]{0} add(%Arg_1.1, %Arg_2.1), metadata={op_name="add"}
  %Arg_6.1 = u32[4]{0} parameter(6)
  %slice.6 = u32[1]{0} slice(%Arg_6.1), slice={[0:1]}, metadata={op_name="slice"}
  %shift_left.4 = u32[1]{0} shift-left(%Arg_2.1, %slice.6), metadata={op_name="shift_left"}
  %constant.8 = u32[] constant(32)
  %squeeze.6 = u32[] reshape(%slice.6), metadata={op_name="squeeze"}
  %sub.4 = u32[] subtract(%constant.8, %squeeze.6), metadata={op_name="sub"}
  %shift_right_logical.9 = u32[1]{0} reshape(%sub.4), metadata={op_name="shift_right_logical"}
  %shift_right_logical.10 = u32[1]{0} shift-right-logical(%Arg_2.1, %shift_right_logical.9), metadata={op_name="shift_right_logical"}
  %or.4 = u32[1]{0} or(%shift_left.4, %shift_right_logical.10), metadata={op_name="or"}
  %xor.6 = u32[1]{0} xor(%add.17, %or.4), metadata={op_name="xor"}
  %add.18 = u32[1]{0} add(%add.17, %xor.6), metadata={op_name="add"}
  %slice.7 = u32[1]{0} slice(%Arg_6.1), slice={[1:2]}, metadata={op_name="slice"}
  %shift_left.5 = u32[1]{0} shift-left(%xor.6, %slice.7), metadata={op_name="shift_left"}
  %squeeze.7 = u32[] reshape(%slice.7), metadata={op_name="squeeze"}
  %sub.5 = u32[] subtract(%constant.8, %squeeze.7), metadata={op_name="sub"}
  %shift_right_logical.11 = u32[1]{0} reshape(%sub.5), metadata={op_name="shift_right_logical"}
  %shift_right_logical.12 = u32[1]{0} shift-right-logical(%xor.6, %shift_right_logical.11), metadata={op_name="shift_right_logical"}
  %or.5 = u32[1]{0} or(%shift_left.5, %shift_right_logical.12), metadata={op_name="or"}
  %xor.7 = u32[1]{0} xor(%add.18, %or.5), metadata={op_name="xor"}
  %add.19 = u32[1]{0} add(%add.18, %xor.7), metadata={op_name="add"}
  %slice.8 = u32[1]{0} slice(%Arg_6.1), slice={[2:3]}, metadata={op_name="slice"}
  %shift_left.6 = u32[1]{0} shift-left(%xor.7, %slice.8), metadata={op_name="shift_left"}
  %squeeze.8 = u32[] reshape(%slice.8), metadata={op_name="squeeze"}
  %sub.6 = u32[] subtract(%constant.8, %squeeze.8), metadata={op_name="sub"}
  %shift_right_logical.13 = u32[1]{0} reshape(%sub.6), metadata={op_name="shift_right_logical"}
  %shift_right_logical.14 = u32[1]{0} shift-right-logical(%xor.7, %shift_right_logical.13), metadata={op_name="shift_right_logical"}
  %or.6 = u32[1]{0} or(%shift_left.6, %shift_right_logical.14), metadata={op_name="or"}
  %xor.8 = u32[1]{0} xor(%add.19, %or.6), metadata={op_name="xor"}
  %add.20 = u32[1]{0} add(%add.19, %xor.8), metadata={op_name="add"}
  %Arg_3.1 = u32[] parameter(3)
  %add.21 = u32[1]{0} reshape(%Arg_3.1), metadata={op_name="add"}
  %add.22 = u32[1]{0} add(%add.20, %add.21), metadata={op_name="add"}
  %slice.9 = u32[1]{0} slice(%Arg_6.1), slice={[3:4]}, metadata={op_name="slice"}
  %shift_left.7 = u32[1]{0} shift-left(%xor.8, %slice.9), metadata={op_name="shift_left"}
  %squeeze.9 = u32[] reshape(%slice.9), metadata={op_name="squeeze"}
  %sub.7 = u32[] subtract(%constant.8, %squeeze.9), metadata={op_name="sub"}
  %shift_right_logical.15 = u32[1]{0} reshape(%sub.7), metadata={op_name="shift_right_logical"}
  %shift_right_logical.16 = u32[1]{0} shift-right-logical(%xor.8, %shift_right_logical.15), metadata={op_name="shift_right_logical"}
  %or.7 = u32[1]{0} or(%shift_left.7, %shift_right_logical.16), metadata={op_name="or"}
  %xor.9 = u32[1]{0} xor(%add.20, %or.7), metadata={op_name="xor"}
  %Arg_4.1 = u32[] parameter(4)
  %add.23 = u32[1]{0} reshape(%Arg_4.1), metadata={op_name="add"}
  %add.24 = u32[1]{0} add(%xor.9, %add.23), metadata={op_name="add"}
  %add.25 = s32[] add(%Arg_0.1, %constant.9), metadata={op_name="add"}
  %convert_element_type.1 = u32[] convert(%add.25), metadata={op_name="convert_element_type"}
  %add.26 = u32[1]{0} reshape(%convert_element_type.1), metadata={op_name="add"}
  %add.27 = u32[1]{0} add(%add.24, %add.26), metadata={op_name="add"}
  %Arg_5.1 = u32[] parameter(5)
  %Arg_7.1 = u32[4]{0} parameter(7)
  ROOT %tuple.1 = (s32[], u32[1]{0}, u32[1]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) tuple(%add.16, %add.22, %add.27, %Arg_4.1, %Arg_5.1, /*index=5*/%Arg_3.1, %Arg_7.1, %Arg_6.1)
}

%region_0.2 (arg_tuple.1: (s32[], s32[], u32[1], u32[1], u32[], /*index=5*/u32[], u32[], u32[4], u32[4])) -> (s32[], s32[], u32[1], u32[1], u32[], /*index=5*/u32[], u32[], u32[4], u32[4]) {
  %arg_tuple.1 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.9 = s32[] get-tuple-element(%arg_tuple.1), index=0
  %constant.10 = s32[] constant(1)
  %add.29 = s32[] add(%get-tuple-element.9, %constant.10), metadata={op_name="while/body/add"}
  %get-tuple-element.10 = s32[] get-tuple-element(%arg_tuple.1), index=1
  %get-tuple-element.11 = u32[1]{0} get-tuple-element(%arg_tuple.1), index=2
  %get-tuple-element.12 = u32[1]{0} get-tuple-element(%arg_tuple.1), index=3
  %get-tuple-element.13 = u32[] get-tuple-element(%arg_tuple.1), index=4
  %get-tuple-element.14 = u32[] get-tuple-element(%arg_tuple.1), index=5
  %get-tuple-element.15 = u32[] get-tuple-element(%arg_tuple.1), index=6
  %get-tuple-element.16 = u32[4]{0} get-tuple-element(%arg_tuple.1), index=7
  %get-tuple-element.17 = u32[4]{0} get-tuple-element(%arg_tuple.1), index=8
  %closed_call.9 = (s32[], u32[1]{0}, u32[1]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) call(%get-tuple-element.10, %get-tuple-element.11, %get-tuple-element.12, %get-tuple-element.13, %get-tuple-element.14, /*index=5*/%get-tuple-element.15, %get-tuple-element.16, %get-tuple-element.17), to_apply=%closed_call.1, metadata={op_name="while/body/closed_call"}
  %closed_call.10 = s32[] get-tuple-element(%closed_call.9), index=0, metadata={op_name="while/body/closed_call"}
  %closed_call.11 = u32[1]{0} get-tuple-element(%closed_call.9), index=1, metadata={op_name="while/body/closed_call"}
  %closed_call.12 = u32[1]{0} get-tuple-element(%closed_call.9), index=2, metadata={op_name="while/body/closed_call"}
  %closed_call.13 = u32[] get-tuple-element(%closed_call.9), index=3, metadata={op_name="while/body/closed_call"}
  %closed_call.14 = u32[] get-tuple-element(%closed_call.9), index=4, metadata={op_name="while/body/closed_call"}
  %closed_call.15 = u32[] get-tuple-element(%closed_call.9), index=5, metadata={op_name="while/body/closed_call"}
  %closed_call.16 = u32[4]{0} get-tuple-element(%closed_call.9), index=6, metadata={op_name="while/body/closed_call"}
  %closed_call.17 = u32[4]{0} get-tuple-element(%closed_call.9), index=7, metadata={op_name="while/body/closed_call"}
  ROOT %tuple.3 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(%add.29, %closed_call.10, %closed_call.11, %closed_call.12, %closed_call.13, /*index=5*/%closed_call.14, %closed_call.15, %closed_call.16, %closed_call.17)
}

%region_1.3 (arg_tuple.3: (s32[], s32[], u32[1], u32[1], u32[], /*index=5*/u32[], u32[], u32[4], u32[4])) -> pred[] {
  %arg_tuple.3 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.27 = s32[] get-tuple-element(%arg_tuple.3), index=0
  %constant.12 = s32[] constant(5)
  ROOT %lt.1 = pred[] compare(%get-tuple-element.27, %constant.12), direction=LT, metadata={op_name="while/cond/lt"}
}

%threefry2x32.4 (jit__threefry_fold_in_.4: u32[], jit__threefry_fold_in_.5: u32[], jit__threefry_fold_in_.6: u32[1], jit__threefry_fold_in_.7: u32[1]) -> (u32[1], u32[1]) {
  %constant.13 = s32[] constant(0)
  %jit__threefry_fold_in_.6 = u32[1]{0} parameter(2), metadata={op_name="jit(_threefry_fold_in)"}
  %jit__threefry_fold_in_.4 = u32[] parameter(0), metadata={op_name="jit(_threefry_fold_in)"}
  %add.30 = u32[1]{0} reshape(%jit__threefry_fold_in_.4), metadata={op_name="add"}
  %add.31 = u32[1]{0} add(%jit__threefry_fold_in_.6, %add.30), metadata={op_name="add"}
  %jit__threefry_fold_in_.7 = u32[1]{0} parameter(3), metadata={op_name="jit(_threefry_fold_in)"}
  %jit__threefry_fold_in_.5 = u32[] parameter(1), metadata={op_name="jit(_threefry_fold_in)"}
  %add.32 = u32[1]{0} reshape(%jit__threefry_fold_in_.5), metadata={op_name="add"}
  %add.33 = u32[1]{0} add(%jit__threefry_fold_in_.7, %add.32), metadata={op_name="add"}
  %xor.10 = u32[] xor(%jit__threefry_fold_in_.4, %jit__threefry_fold_in_.5), metadata={op_name="xor"}
  %constant.14 = u32[] constant(466688986)
  %xor.11 = u32[] xor(%xor.10, %constant.14), metadata={op_name="xor"}
  %constant.15 = u32[4]{0} constant({13, 15, 26, 6})
  %constant.16 = u32[4]{0} constant({17, 29, 16, 24})
  %while.11 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(%constant.13, %constant.13, %add.31, %add.33, %jit__threefry_fold_in_.5, /*index=5*/%xor.11, %jit__threefry_fold_in_.4, %constant.15, %constant.16), metadata={op_name="while"}
  %while.12 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) while(%while.11), condition=%region_1.3, body=%region_0.2, metadata={op_name="while"}
  %while.15 = u32[1]{0} get-tuple-element(%while.12), index=2, metadata={op_name="while"}
  %while.16 = u32[1]{0} get-tuple-element(%while.12), index=3, metadata={op_name="while"}
  ROOT %tuple.5 = (u32[1]{0}, u32[1]{0}) tuple(%while.15, %while.16)
}

ENTRY %main.5 (key.1: u32[2], data.1: u32[]) -> u32[2] {
  %key.1 = u32[2]{0} parameter(0), metadata={op_name="key"}
  %slice.10 = u32[1]{0} slice(%key.1), slice={[0:1]}, metadata={op_name="jit(_threefry_fold_in)/slice" stack_frame_id=11}
  %squeeze.10 = u32[] reshape(%slice.10), metadata={op_name="jit(_threefry_fold_in)/squeeze" stack_frame_id=11}
  %slice.11 = u32[1]{0} slice(%key.1), slice={[1:2]}, metadata={op_name="jit(_threefry_fold_in)/slice" stack_frame_id=11}
  %squeeze.11 = u32[] reshape(%slice.11), metadata={op_name="jit(_threefry_fold_in)/squeeze" stack_frame_id=11}
  %data.1 = u32[] parameter(1), metadata={op_name="data"}
  %constant.17 = u32[] constant(32)
  %shift_right_logical.17 = u32[] shift-right-logical(%data.1, %constant.17), metadata={op_name="jit(_threefry_fold_in)/shift_right_logical" stack_frame_id=11}
  %broadcast_in_dim.2 = u32[1]{0} reshape(%shift_right_logical.17), metadata={op_name="jit(_threefry_fold_in)/broadcast_in_dim" stack_frame_id=11}
  %broadcast_in_dim.3 = u32[1]{0} reshape(%data.1), metadata={op_name="jit(_threefry_fold_in)/broadcast_in_dim" stack_frame_id=11}
  %jit__threefry_fold_in_.11 = (u32[1]{0}, u32[1]{0}) call(%squeeze.10, %squeeze.11, %broadcast_in_dim.2, %broadcast_in_dim.3), to_apply=%threefry2x32.4, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %jit__threefry_fold_in_.12 = u32[1]{0} get-tuple-element(%jit__threefry_fold_in_.11), index=0, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %jit__threefry_fold_in_.13 = u32[1]{0} get-tuple-element(%jit__threefry_fold_in_.11), index=1, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  ROOT %concatenate.1 = u32[2]{0} concatenate(%jit__threefry_fold_in_.12, %jit__threefry_fold_in_.13), dimensions={0}, metadata={op_name="jit(_threefry_fold_in)/concatenate" stack_frame_id=11}
}

