HloModule jit__threefry_fold_in, entry_computation_layout={(u32[2]{0}, u32[])->u32[2]{0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

FileNames
1 "/Users/chaitanya/Downloads/MLIR/end2end/ml-compiler/JAX/model.py"
2 "/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/pytreelib.py"
3 "/Users/chaitanya/Downloads/MLIR/end2end/ml-compiler/JAX/src/MyNeuralNet.py"
4 "/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/nn/linear.py"
5 "/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/rnglib.py"

FunctionNames
1 "<module>"
2 "main"
3 "PytreeMeta.__call__"
4 "_graph_node_meta_call"
5 "PytreeMeta._pytree_meta_construct"
6 "MyNeuralNet.__init__"
7 "Linear.__init__"
8 "RngStream.__call__"

FileLocations
1 {file_name_id=1 function_name_id=1 line=70 end_line=70 column=4 end_column=10}
2 {file_name_id=1 function_name_id=2 line=20 end_line=20 column=12 end_column=114}
3 {file_name_id=2 function_name_id=3 line=420 end_line=420 column=13 end_column=56}
4 {file_name_id=2 function_name_id=4 line=431 end_line=431 column=2 end_column=51}
5 {file_name_id=2 function_name_id=5 line=423 end_line=423 column=4 end_column=34}
6 {file_name_id=3 function_name_id=6 line=9 end_line=9 column=22 end_column=68}
7 {file_name_id=4 function_name_id=7 line=375 end_line=375 column=17 end_column=30}
8 {file_name_id=5 function_name_id=8 line=122 end_line=122 column=10 end_column=56}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=6}
7 {file_location_id=3 parent_frame_id=7}
8 {file_location_id=4 parent_frame_id=8}
9 {file_location_id=5 parent_frame_id=9}
10 {file_location_id=7 parent_frame_id=10}
11 {file_location_id=8 parent_frame_id=11}


%region_0.2.clone.clone (arg_tuple.4: (s32[], s32[], u32[1], u32[1], u32[], /*index=5*/u32[], u32[], u32[4], u32[4])) -> (s32[], s32[], u32[1], u32[1], u32[], /*index=5*/u32[], u32[], u32[4], u32[4]) {
  %arg_tuple.4 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.56 = s32[] get-tuple-element(%arg_tuple.4), index=0
  %get-tuple-element.55 = s32[] get-tuple-element(%arg_tuple.4), index=1
  %get-tuple-element.54 = s32[] get-tuple-element(%arg_tuple.4), index=0
  %constant.0.clone.2 = s32[] constant(1), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call" stack_frame_id=11}
  %multiply.2 = s32[] multiply(%get-tuple-element.54, %constant.0.clone.2)
  %add.61 = s32[] add(%get-tuple-element.55, %multiply.2)
  %get-tuple-element.53 = u32[1]{0} get-tuple-element(%arg_tuple.4), index=2
  %get-tuple-element.52 = u32[1]{0} get-tuple-element(%arg_tuple.4), index=3
  %get-tuple-element.51 = u32[] get-tuple-element(%arg_tuple.4), index=4
  %get-tuple-element.50 = u32[] get-tuple-element(%arg_tuple.4), index=5
  %get-tuple-element.49 = u32[] get-tuple-element(%arg_tuple.4), index=6
  %get-tuple-element.48 = u32[4]{0} get-tuple-element(%arg_tuple.4), index=7
  %get-tuple-element.47 = u32[4]{0} get-tuple-element(%arg_tuple.4), index=8
  %tuple.8 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(%get-tuple-element.56, %add.61, %get-tuple-element.53, %get-tuple-element.52, %get-tuple-element.51, /*index=5*/%get-tuple-element.50, %get-tuple-element.49, %get-tuple-element.48, %get-tuple-element.47)
  %get-tuple-element.43 = s32[] get-tuple-element(%tuple.8), index=0, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %constant.19 = s32[] constant(1), metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %add.48 = s32[] add(%get-tuple-element.43, %constant.19), metadata={op_name="jit(_threefry_fold_in)/while/body/add" stack_frame_id=11}
  %get-tuple-element.44 = s32[] get-tuple-element(%tuple.8), index=1, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %constant.20 = s32[] constant(1), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call" stack_frame_id=11}
  %add.49 = s32[] add(%get-tuple-element.44, %constant.20), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %get-tuple-element.45 = u32[1]{0} get-tuple-element(%tuple.8), index=2, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %get-tuple-element.46 = u32[1]{0} get-tuple-element(%tuple.8), index=3, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %add.50 = u32[1]{0} add(%get-tuple-element.45, %get-tuple-element.46), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %closed_call.8 = u32[4]{0} get-tuple-element(%tuple.8), index=7, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %slice.14 = u32[1]{0} slice(%closed_call.8), slice={[0:1]}, metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/slice" stack_frame_id=11}
  %shift_left.12 = u32[1]{0} shift-left(%get-tuple-element.46, %slice.14), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_left" stack_frame_id=11}
  %constant.22 = u32[1]{0} constant({32}), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call" stack_frame_id=11}
  %sub.16 = u32[1]{0} subtract(%constant.22, %slice.14), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/sub" stack_frame_id=11}
  %reshape.3 = u32[] reshape(%sub.16), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/sub" stack_frame_id=11}
  %shift_right_logical.25 = u32[1]{0} reshape(%reshape.3), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_right_logical" stack_frame_id=11}
  %shift_right_logical.26 = u32[1]{0} shift-right-logical(%get-tuple-element.46, %shift_right_logical.25), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_right_logical" stack_frame_id=11}
  %or.12 = u32[1]{0} or(%shift_left.12, %shift_right_logical.26), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/or" stack_frame_id=11}
  %xor.16 = u32[1]{0} xor(%add.50, %or.12), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/xor" stack_frame_id=11}
  %add.51 = u32[1]{0} add(%add.50, %xor.16), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %slice.15 = u32[1]{0} slice(%closed_call.8), slice={[1:2]}, metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/slice" stack_frame_id=11}
  %shift_left.13 = u32[1]{0} shift-left(%xor.16, %slice.15), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_left" stack_frame_id=11}
  %constant.23 = u32[1]{0} constant({32}), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call" stack_frame_id=11}
  %sub.17 = u32[1]{0} subtract(%constant.23, %slice.15), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/sub" stack_frame_id=11}
  %reshape.5 = u32[] reshape(%sub.17), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/sub" stack_frame_id=11}
  %shift_right_logical.27 = u32[1]{0} reshape(%reshape.5), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_right_logical" stack_frame_id=11}
  %shift_right_logical.28 = u32[1]{0} shift-right-logical(%xor.16, %shift_right_logical.27), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_right_logical" stack_frame_id=11}
  %or.13 = u32[1]{0} or(%shift_left.13, %shift_right_logical.28), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/or" stack_frame_id=11}
  %xor.17 = u32[1]{0} xor(%add.51, %or.13), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/xor" stack_frame_id=11}
  %add.52 = u32[1]{0} add(%add.51, %xor.17), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %slice.16 = u32[1]{0} slice(%closed_call.8), slice={[2:3]}, metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/slice" stack_frame_id=11}
  %shift_left.14 = u32[1]{0} shift-left(%xor.17, %slice.16), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_left" stack_frame_id=11}
  %constant.24 = u32[1]{0} constant({32}), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call" stack_frame_id=11}
  %sub.18 = u32[1]{0} subtract(%constant.24, %slice.16), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/sub" stack_frame_id=11}
  %reshape.7 = u32[] reshape(%sub.18), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/sub" stack_frame_id=11}
  %shift_right_logical.29 = u32[1]{0} reshape(%reshape.7), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_right_logical" stack_frame_id=11}
  %shift_right_logical.30 = u32[1]{0} shift-right-logical(%xor.17, %shift_right_logical.29), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_right_logical" stack_frame_id=11}
  %or.14 = u32[1]{0} or(%shift_left.14, %shift_right_logical.30), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/or" stack_frame_id=11}
  %xor.18 = u32[1]{0} xor(%add.52, %or.14), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/xor" stack_frame_id=11}
  %add.53 = u32[1]{0} add(%add.52, %xor.18), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %closed_call.5 = u32[] get-tuple-element(%tuple.8), index=4, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %add.54 = u32[1]{0} reshape(%closed_call.5), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %add.55 = u32[1]{0} add(%add.53, %add.54), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %slice.17 = u32[1]{0} slice(%closed_call.8), slice={[3:4]}, metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/slice" stack_frame_id=11}
  %shift_left.15 = u32[1]{0} shift-left(%xor.18, %slice.17), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_left" stack_frame_id=11}
  %constant.25 = u32[1]{0} constant({32}), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call" stack_frame_id=11}
  %sub.19 = u32[1]{0} subtract(%constant.25, %slice.17), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/sub" stack_frame_id=11}
  %reshape.9 = u32[] reshape(%sub.19), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/sub" stack_frame_id=11}
  %shift_right_logical.31 = u32[1]{0} reshape(%reshape.9), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_right_logical" stack_frame_id=11}
  %shift_right_logical.32 = u32[1]{0} shift-right-logical(%xor.18, %shift_right_logical.31), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/shift_right_logical" stack_frame_id=11}
  %or.15 = u32[1]{0} or(%shift_left.15, %shift_right_logical.32), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/or" stack_frame_id=11}
  %xor.19 = u32[1]{0} xor(%add.53, %or.15), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/xor" stack_frame_id=11}
  %closed_call.6 = u32[] get-tuple-element(%tuple.8), index=5, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %add.56 = u32[1]{0} reshape(%closed_call.6), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %add.57 = u32[1]{0} add(%xor.19, %add.56), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %add.58 = s32[] add(%get-tuple-element.44, %constant.20), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %convert_element_type.3 = u32[] convert(%add.58), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/convert_element_type" stack_frame_id=11}
  %add.59 = u32[1]{0} reshape(%convert_element_type.3), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %add.60 = u32[1]{0} add(%add.57, %add.59), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call/add" stack_frame_id=11}
  %closed_call.7 = u32[] get-tuple-element(%tuple.8), index=6, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %closed_call.18 = u32[4]{0} get-tuple-element(%tuple.8), index=8, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %tuple.6.clone = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(%add.48, %add.49, %add.55, %add.60, %closed_call.6, /*index=5*/%closed_call.7, %closed_call.5, %closed_call.18, %closed_call.8), metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %get-tuple-element.65 = s32[] get-tuple-element(%tuple.6.clone), index=0
  %get-tuple-element.64 = s32[] get-tuple-element(%arg_tuple.4), index=1
  %get-tuple-element.63 = u32[1]{0} get-tuple-element(%tuple.6.clone), index=2
  %get-tuple-element.62 = u32[1]{0} get-tuple-element(%tuple.6.clone), index=3
  %get-tuple-element.61 = u32[] get-tuple-element(%tuple.6.clone), index=4
  %get-tuple-element.60 = u32[] get-tuple-element(%tuple.6.clone), index=5
  %get-tuple-element.59 = u32[] get-tuple-element(%tuple.6.clone), index=6
  %get-tuple-element.58 = u32[4]{0} get-tuple-element(%tuple.6.clone), index=7
  %get-tuple-element.57 = u32[4]{0} get-tuple-element(%tuple.6.clone), index=8
  ROOT %tuple.9 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(%get-tuple-element.65, %get-tuple-element.64, %get-tuple-element.63, %get-tuple-element.62, %get-tuple-element.61, /*index=5*/%get-tuple-element.60, %get-tuple-element.59, %get-tuple-element.58, %get-tuple-element.57)
}

%region_1.3.clone (arg_tuple.2: (s32[], s32[], u32[1], u32[1], u32[], /*index=5*/u32[], u32[], u32[4], u32[4])) -> pred[] {
  %arg_tuple.2 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.42 = s32[] get-tuple-element(%arg_tuple.2), index=0
  %get-tuple-element.41 = s32[] get-tuple-element(%arg_tuple.2), index=1
  %get-tuple-element.40 = s32[] get-tuple-element(%arg_tuple.2), index=0
  %constant.0.clone.1 = s32[] constant(1), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call" stack_frame_id=11}
  %multiply.1 = s32[] multiply(%get-tuple-element.40, %constant.0.clone.1)
  %add.47 = s32[] add(%get-tuple-element.41, %multiply.1)
  %get-tuple-element.39 = u32[1]{0} get-tuple-element(%arg_tuple.2), index=2
  %get-tuple-element.38 = u32[1]{0} get-tuple-element(%arg_tuple.2), index=3
  %get-tuple-element.37 = u32[] get-tuple-element(%arg_tuple.2), index=4
  %get-tuple-element.36 = u32[] get-tuple-element(%arg_tuple.2), index=5
  %get-tuple-element.26 = u32[] get-tuple-element(%arg_tuple.2), index=6
  %get-tuple-element.25 = u32[4]{0} get-tuple-element(%arg_tuple.2), index=7
  %get-tuple-element.24 = u32[4]{0} get-tuple-element(%arg_tuple.2), index=8
  %tuple.7 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(%get-tuple-element.42, %add.47, %get-tuple-element.39, %get-tuple-element.38, %get-tuple-element.37, /*index=5*/%get-tuple-element.36, %get-tuple-element.26, %get-tuple-element.25, %get-tuple-element.24)
  %get-tuple-element.23 = s32[] get-tuple-element(%tuple.7), index=0, metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %constant.18 = s32[] constant(5), metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  ROOT %lt.0 = pred[] compare(%get-tuple-element.23, %constant.18), direction=LT, metadata={op_name="jit(_threefry_fold_in)/while/cond/lt" stack_frame_id=11}
}

ENTRY %main.5 (key.1: u32[2], data.1: u32[]) -> u32[2] {
  %constant.2 = s32[] constant(0), metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %data.1 = u32[] parameter(1), metadata={op_name="data"}
  %constant.17 = u32[] constant(32)
  %shift_right_logical.17 = u32[] shift-right-logical(%data.1, %constant.17), metadata={op_name="jit(_threefry_fold_in)/shift_right_logical" stack_frame_id=11}
  %broadcast_in_dim.2 = u32[1]{0} reshape(%shift_right_logical.17), metadata={op_name="jit(_threefry_fold_in)/broadcast_in_dim" stack_frame_id=11}
  %key.1 = u32[2]{0} parameter(0), metadata={op_name="key"}
  %slice.10 = u32[1]{0} slice(%key.1), slice={[0:1]}, metadata={op_name="jit(_threefry_fold_in)/slice" stack_frame_id=11}
  %add.13 = u32[1]{0} add(%broadcast_in_dim.2, %slice.10), metadata={op_name="jit(_threefry_fold_in)/add" stack_frame_id=11}
  %broadcast_in_dim.3 = u32[1]{0} reshape(%data.1), metadata={op_name="jit(_threefry_fold_in)/broadcast_in_dim" stack_frame_id=11}
  %slice.11 = u32[1]{0} slice(%key.1), slice={[1:2]}, metadata={op_name="jit(_threefry_fold_in)/slice" stack_frame_id=11}
  %add.15 = u32[1]{0} add(%broadcast_in_dim.3, %slice.11), metadata={op_name="jit(_threefry_fold_in)/add" stack_frame_id=11}
  %squeeze.11 = u32[] reshape(%slice.11), metadata={op_name="jit(_threefry_fold_in)/squeeze" stack_frame_id=11}
  %squeeze.10 = u32[] reshape(%slice.10), metadata={op_name="jit(_threefry_fold_in)/squeeze" stack_frame_id=11}
  %xor.4 = u32[] xor(%squeeze.10, %squeeze.11), metadata={op_name="jit(_threefry_fold_in)/xor" stack_frame_id=11}
  %constant.3 = u32[] constant(466688986), metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %xor.5 = u32[] xor(%xor.4, %constant.3), metadata={op_name="jit(_threefry_fold_in)/xor" stack_frame_id=11}
  %constant.4 = u32[4]{0} constant({13, 15, 26, 6}), metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %constant.5 = u32[4]{0} constant({17, 29, 16, 24}), metadata={op_name="jit(_threefry_fold_in)" stack_frame_id=11}
  %while.0 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(%constant.2, %constant.2, %add.13, %add.15, %squeeze.11, /*index=5*/%xor.5, %squeeze.10, %constant.4, %constant.5), metadata={op_name="jit(_threefry_fold_in)/while" stack_frame_id=11}
  %while.4 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) while(%while.0), condition=%region_1.3.clone, body=%region_0.2.clone.clone, metadata={op_name="jit(_threefry_fold_in)/while" stack_frame_id=11}
  %get-tuple-element.66 = s32[] get-tuple-element(%while.4), index=0
  %get-tuple-element.67 = s32[] get-tuple-element(%while.4), index=1
  %get-tuple-element.68 = s32[] get-tuple-element(%while.4), index=0
  %constant.0.clone.3 = s32[] constant(1), metadata={op_name="jit(_threefry_fold_in)/while/body/closed_call" stack_frame_id=11}
  %multiply.3 = s32[] multiply(%get-tuple-element.68, %constant.0.clone.3)
  %add.62 = s32[] add(%get-tuple-element.67, %multiply.3)
  %get-tuple-element.69 = u32[1]{0} get-tuple-element(%while.4), index=2
  %get-tuple-element.70 = u32[1]{0} get-tuple-element(%while.4), index=3
  %get-tuple-element.71 = u32[] get-tuple-element(%while.4), index=4
  %get-tuple-element.72 = u32[] get-tuple-element(%while.4), index=5
  %get-tuple-element.73 = u32[] get-tuple-element(%while.4), index=6
  %get-tuple-element.74 = u32[4]{0} get-tuple-element(%while.4), index=7
  %get-tuple-element.75 = u32[4]{0} get-tuple-element(%while.4), index=8
  %tuple.10 = (s32[], s32[], u32[1]{0}, u32[1]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(%get-tuple-element.66, %add.62, %get-tuple-element.69, %get-tuple-element.70, %get-tuple-element.71, /*index=5*/%get-tuple-element.72, %get-tuple-element.73, %get-tuple-element.74, %get-tuple-element.75), metadata={op_name="jit(_threefry_fold_in)/while" stack_frame_id=11}
  %jit__threefry_fold_in_.12 = u32[1]{0} get-tuple-element(%tuple.10), index=2, metadata={op_name="jit(_threefry_fold_in)/while" stack_frame_id=11}
  %jit__threefry_fold_in_.13 = u32[1]{0} get-tuple-element(%tuple.10), index=3, metadata={op_name="jit(_threefry_fold_in)/while" stack_frame_id=11}
  ROOT %concatenate.1 = u32[2]{0} concatenate(%jit__threefry_fold_in_.12, %jit__threefry_fold_in_.13), dimensions={0}, metadata={op_name="jit(_threefry_fold_in)/concatenate" stack_frame_id=11}
}

