#loc = loc(unknown)
#loc1 = loc("key")
#loc2 = loc("data")
#loc3 = loc("/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/rnglib.py":122:10 to :56)
#loc4 = loc("/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/nn/linear.py":375:17 to :30)
#loc5 = loc("/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/pytreelib.py":423:4 to :34)
#loc6 = loc("/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/pytreelib.py":431:2 to :51)
#loc7 = loc("/Users/chaitanya/.venv-py11/lib/python3.11/site-packages/flax/nnx/pytreelib.py":420:13 to :56)
#loc8 = loc("/Users/chaitanya/Downloads/MLIR/end2end/ml-compiler/JAX/src/MyNeuralNet.py":9:22 to :68)
#loc9 = loc("/Users/chaitanya/Downloads/MLIR/end2end/ml-compiler/JAX/model.py":20:12 to :114)
#loc10 = loc("/Users/chaitanya/Downloads/MLIR/end2end/ml-compiler/JAX/model.py":70:4 to :10)
#loc26 = loc("RngStream.__call__"(#loc3))
#loc27 = loc("Linear.__init__"(#loc4))
#loc28 = loc("PytreeMeta._pytree_meta_construct"(#loc5))
#loc29 = loc("_graph_node_meta_call"(#loc6))
#loc30 = loc("PytreeMeta.__call__"(#loc7))
#loc31 = loc("MyNeuralNet.__init__"(#loc8))
#loc32 = loc("main"(#loc9))
#loc33 = loc("<module>"(#loc10))
#loc36 = loc(callsite(#loc32 at #loc33))
#loc37 = loc(callsite(#loc30 at #loc36))
#loc38 = loc(callsite(#loc29 at #loc37))
#loc39 = loc(callsite(#loc28 at #loc38))
#loc40 = loc(callsite(#loc31 at #loc39))
#loc41 = loc(callsite(#loc30 at #loc40))
#loc42 = loc(callsite(#loc29 at #loc41))
#loc43 = loc(callsite(#loc28 at #loc42))
#loc44 = loc(callsite(#loc27 at #loc43))
#loc45 = loc(callsite(#loc26 at #loc44))
#loc46 = loc("jit(_threefry_fold_in)"(#loc45))
module @jit__threefry_fold_in attributes {mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32> loc("key"), %arg1: tensor<ui32> loc("data")) -> (tensor<2xui32> {jax.result_info = "result"}) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc46)
    %0 = stablehlo.shift_right_logical %arg1, %c : tensor<ui32> loc(#loc47)
    %1 = stablehlo.broadcast_in_dim %0, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc48)
    %c_0 = stablehlo.constant dense<4294967295> : tensor<ui32> loc(#loc46)
    %2 = stablehlo.and %arg1, %c_0 : tensor<ui32> loc(#loc49)
    %3 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc48)
    %4 = stablehlo.concatenate %1, %3, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc50)
    %5 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc51)
    %6 = stablehlo.reshape %5 : (tensor<1xui32>) -> tensor<ui32> loc(#loc52)
    %7 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc51)
    %8 = stablehlo.reshape %7 : (tensor<1xui32>) -> tensor<ui32> loc(#loc52)
    %9 = stablehlo.slice %4 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc53)
    %10 = stablehlo.slice %4 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc53)
    %11:2 = call @threefry2x32(%6, %8, %9, %10) : (tensor<ui32>, tensor<ui32>, tensor<1xui32>, tensor<1xui32>) -> (tensor<1xui32>, tensor<1xui32>) loc(#loc46)
    %12 = stablehlo.concatenate %11#0, %11#1, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc50)
    return %12 : tensor<2xui32> loc(#loc46)
  } loc(#loc)
  func.func private @threefry2x32(%arg0: tensor<ui32> loc("jit(_threefry_fold_in)"(#loc45)), %arg1: tensor<ui32> loc("jit(_threefry_fold_in)"(#loc45)), %arg2: tensor<1xui32> loc("jit(_threefry_fold_in)"(#loc45)), %arg3: tensor<1xui32> loc("jit(_threefry_fold_in)"(#loc45))) -> (tensor<1xui32>, tensor<1xui32>) {
    %c = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc34)
    %c_0 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc34)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc12)
    %c_1 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc34)
    %1 = stablehlo.xor %0, %c_1 : tensor<ui32> loc(#loc12)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc13)
    %3 = stablehlo.add %arg2, %2 : tensor<1xui32> loc(#loc13)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc13)
    %5 = stablehlo.add %arg3, %4 : tensor<1xui32> loc(#loc13)
    %c_2 = stablehlo.constant dense<0> : tensor<i32> loc(#loc34)
    %c_3 = stablehlo.constant dense<0> : tensor<i32> loc(#loc14)
    %6:9 = stablehlo.while(%iterArg = %c_3, %iterArg_4 = %c_2, %iterArg_5 = %3, %iterArg_6 = %5, %iterArg_7 = %arg1, %iterArg_8 = %1, %iterArg_9 = %arg0, %iterArg_10 = %c, %iterArg_11 = %c_0) : tensor<i32>, tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %c_12 = stablehlo.constant dense<5> : tensor<i32> loc(#loc15)
      %7 = stablehlo.compare LT, %iterArg, %c_12, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc16)
      stablehlo.return %7 : tensor<i1> loc(#loc15)
    } do {
      %7:8 = func.call @closed_call(%iterArg_4, %iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11) : (tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc17)
      %c_12 = stablehlo.constant dense<1> : tensor<i32> loc(#loc15)
      %8 = stablehlo.add %iterArg, %c_12 : tensor<i32> loc(#loc18)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc15)
    } loc(#loc15)
    return %6#2, %6#3 : tensor<1xui32>, tensor<1xui32> loc(#loc46)
  } loc(#loc46)
  func.func private @closed_call(%arg0: tensor<i32> loc(unknown), %arg1: tensor<1xui32> loc(unknown), %arg2: tensor<1xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c : tensor<i32> loc(#loc13)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc19)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc20)
    %3 = stablehlo.add %arg1, %arg2 : tensor<1xui32> loc(#loc13)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc21)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<1xui32> loc(#loc21)
    %c_0 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %6 = stablehlo.subtract %c_0, %2 : tensor<ui32> loc(#loc22)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc23)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<1xui32> loc(#loc23)
    %9 = stablehlo.or %5, %8 : tensor<1xui32> loc(#loc24)
    %10 = stablehlo.xor %3, %9 : tensor<1xui32> loc(#loc12)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc19)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc20)
    %13 = stablehlo.add %3, %10 : tensor<1xui32> loc(#loc13)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc21)
    %15 = stablehlo.shift_left %10, %14 : tensor<1xui32> loc(#loc21)
    %c_1 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %16 = stablehlo.subtract %c_1, %12 : tensor<ui32> loc(#loc22)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc23)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<1xui32> loc(#loc23)
    %19 = stablehlo.or %15, %18 : tensor<1xui32> loc(#loc24)
    %20 = stablehlo.xor %13, %19 : tensor<1xui32> loc(#loc12)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc19)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc20)
    %23 = stablehlo.add %13, %20 : tensor<1xui32> loc(#loc13)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc21)
    %25 = stablehlo.shift_left %20, %24 : tensor<1xui32> loc(#loc21)
    %c_2 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %26 = stablehlo.subtract %c_2, %22 : tensor<ui32> loc(#loc22)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc23)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<1xui32> loc(#loc23)
    %29 = stablehlo.or %25, %28 : tensor<1xui32> loc(#loc24)
    %30 = stablehlo.xor %23, %29 : tensor<1xui32> loc(#loc12)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc19)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc20)
    %33 = stablehlo.add %23, %30 : tensor<1xui32> loc(#loc13)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc21)
    %35 = stablehlo.shift_left %30, %34 : tensor<1xui32> loc(#loc21)
    %c_3 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %36 = stablehlo.subtract %c_3, %32 : tensor<ui32> loc(#loc22)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc23)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<1xui32> loc(#loc23)
    %39 = stablehlo.or %35, %38 : tensor<1xui32> loc(#loc24)
    %40 = stablehlo.xor %33, %39 : tensor<1xui32> loc(#loc12)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc13)
    %42 = stablehlo.add %33, %41 : tensor<1xui32> loc(#loc13)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc13)
    %44 = stablehlo.add %40, %43 : tensor<1xui32> loc(#loc13)
    %c_4 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %45 = stablehlo.add %arg0, %c_4 : tensor<i32> loc(#loc13)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc25)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc13)
    %48 = stablehlo.add %44, %47 : tensor<1xui32> loc(#loc13)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc35)
} loc(#loc)
#loc11 = loc("threefry2x32")
#loc12 = loc("xor")
#loc13 = loc("add")
#loc14 = loc("scan")
#loc15 = loc("while")
#loc16 = loc("while/cond/lt")
#loc17 = loc("while/body/closed_call")
#loc18 = loc("while/body/add")
#loc19 = loc("slice")
#loc20 = loc("squeeze")
#loc21 = loc("shift_left")
#loc22 = loc("sub")
#loc23 = loc("shift_right_logical")
#loc24 = loc("or")
#loc25 = loc("convert_element_type")
#loc34 = loc("threefry2x32:"(#loc11))
#loc35 = loc("closed_call:"(#loc17))
#loc47 = loc("jit(_threefry_fold_in)/shift_right_logical"(#loc45))
#loc48 = loc("jit(_threefry_fold_in)/broadcast_in_dim"(#loc45))
#loc49 = loc("jit(_threefry_fold_in)/and"(#loc45))
#loc50 = loc("jit(_threefry_fold_in)/concatenate"(#loc45))
#loc51 = loc("jit(_threefry_fold_in)/slice"(#loc45))
#loc52 = loc("jit(_threefry_fold_in)/squeeze"(#loc45))
#loc53 = loc("jit(_threefry_fold_in)/split"(#loc45))
